from random import *
# print(random()) # 0 ~ 1미만 의 랜덤한 값 생성
# print(random()*10) # 0 ~ 10 미만의 랜덤한 값 생성
# print(int(random()*10)) # 소수버리고 정수만 출력
# print(int(random()*10)+1) # 1 ~ 11미만의 랜덤한값 (정수만)

# 로또 난수 출력 ---------------------------------------------
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
# print(int(random()*45)+1) # 1 ~ 46미만의 랜덤한값 (정수만)
#-----------------------------------------------------------

print(randrange(1,46)) # 1~ 46미만의 값을 생성하라
print(randrange(1,46)) # 1~ 46미만의 값을 생성하라
print(randrange(1,46)) # 1~ 46미만의 값을 생성하라
print(randrange(1,46)) # 1~ 46미만의 값을 생성하라
print(randrange(1,46)) # 1~ 46미만의 값을 생성하라
print(randrange(1,46)) # 1~ 46미만의 값을 생성하라

#--------------------------------------------------------------
print(randint(1,45)) # 1~45의 값..양 끝단을 포함한 값을 넣고 랜덤 추출

