# --------------while문------------------
# 스타벅스에서 손님 5번 부르고 커피 폐기
# customer = "타미"
# index = 5  #다섯번을 확인하기위한 변수
# while index >= 1:  #while..조건이 만족하는동안은 계속돌아라
#     print("{0},커피가 준비되었습니다.{1}번 남앗어요".format(customer,index))
#     index -= 1
#     if index == 0:
#         print("커피는 폐기처분되었습니다.")

customer = "림이"
index = 1
while True:
    print("{0},커피가 준비됬다요... 호출 {1}번 남았다요..".format(customer,index))
    index +=1



##---------------------------------------------------------------------------------------------------
# customer = "달"
# index = 5  # 호출 횟수 저장을 위한 변수
# while index >= 1:
#    print('{0}님,\"여친이야?화장실이야?\" 질문이 도착하었습니다.기회는 {1}번 남았어요'.format(customer,index))
#    index -=1
#    if index ==0:
#        print("여자친구 약정이 해제되었습니다")
##---------------------------------------------------------------------------------------------------
